app/views/profiles/index.html.erb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = ?  [["user_id", 4]]
SELECT 1 AS one FROM "recipes" WHERE "recipes"."user_id" = ? LIMIT ?  [["user_id", 5], ["LIMIT", 1]]
---
<h2> Recipes: </h2>
  <% if @user.recipes.empty? %>

SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = ?  [["user_id", 6]]
---
    <ul>
    <% @user.recipes.each do |r| %>

SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ?  [["user_id", 52]]
SELECT 1 AS one FROM "reviews" WHERE "reviews"."user_id" = ? LIMIT ?  [["user_id", 5], ["LIMIT", 1]]
---
  <h2> Reviews: </h2>
  <% if @user.reviews.empty? %>

SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ?  [["user_id", 52]]
---
    <ul>
    <% @user.reviews.each do |r| %>

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]
---
          <td>
            <%= Recipe.find(r.recipe_id).title %>

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 93], ["LIMIT", 1]]
---
		  <td>
			  <%= link_to "Show related recipe", Recipe.find(r.recipe_id) %>