app/views/recipes/show.html.erb

SELECT 1 AS one FROM "reviews" WHERE "reviews"."recipe_id" = ? LIMIT ?  [["recipe_id", 1], ["LIMIT", 1]]
---
<h2> Reviews: </h2>
  <% if @recipe.reviews.empty? %>