app/views/recipes/show.html.erb

<h2> Reviews: </h2>
  <% if @recipe.reviews.empty? %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."recipe_id" = ?  [["recipe_id", 1]]
SELECT 1 AS one FROM "reviews" WHERE "reviews"."recipe_id" = ? LIMIT ?  [["recipe_id", 9], ["LIMIT", 1]]

    <ul>
    <% @recipe.reviews.each do |r| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."recipe_id" = ?  [["recipe_id", 1]]