app/controllers/profiles_controller.rb

    def show
        # non è ancora usata

        # inserire il controllo per vedere se si è amministratori e poi aggiungere anche il controllo
        #  nella index di profiles per far apparire il bottone "vedi tutti gli utenti"

		@users = User.all
---
SELECT "users".* FROM "users"

    def destroy

		set_user()

		# Autorizzazioni (Canard + CanCan)
		authorize! :destroy, @user, :message => "BEWARE: you are not authorized to delete users."

		if @user.admin?
			redirect_back_or_to root_path, notice: "You cannot delete an admin."
		else
			@user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 140]]