app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("title", "typology", "description", "video", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def create
		# id_user = session[:user_id]
		# @user = User.find(id_user)

		@user = current_user
		@recipe = Recipe.new(recipe_params)
		@recipe.user = @user

		# Autorizzazioni (Canard + CanCan)
		authorize! :create, @recipe, :message => "BEWARE: you are not authorized to create new recipe."

		respond_to do |format|
		if @recipe.save

UPDATE "recipes" SET "title" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["title", "Prova Ricetta Updated"], ["updated_at", "2022-06-09 10:13:49.540326"], ["id", 5]]
---
	def update

		# Autorizzazioni (Canard + CanCan)
		authorize! :update, @recipe, :message => "BEWARE: you are not authorized to update recipes."

		respond_to do |format|
			if @recipe.update(recipe_params)

DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 69]]
---
	def destroy

		# Autorizzazioni (Canard + CanCan)
		if (current_user != @recipe.user)
			authorize! :destroy, @recipe, :message => "BEWARE: you are not authorized to delete recipes."
		end

		@recipe.destroy