app/controllers/reviews_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 93], ["LIMIT", 1]]
---
	def new
		# if (!session[:user_id]||session[:user_id]=="")
		#   redirect_to users_path(session[:user_id])
		# else


		#id_user = session[:user_id]
		#@user = User.find(id_user)
		id_recipe = params[:recipe_id]
		@recipe = Recipe.find(id_recipe)

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 93], ["LIMIT", 1]]
INSERT INTO "reviews" ("rating", "description", "recipe_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 1], ["description", "p"], ["recipe_id", 93], ["user_id", 130], ["created_at", "2022-06-10 13:42:24.450721"], ["updated_at", "2022-06-10 13:42:24.450721"]]
---
	def create

		@user = current_user

		# id_user = session[:user_id]
			# @user = User.find(id_user)

		id_recipe = params[:recipe_id]
		@recipe = Recipe.find(id_recipe)
		@review = Review.new(review_params)
		@review.recipe = @recipe
		@review.user = @user

		# Autorizzazioni (Canard + CanCan)
		authorize! :create, @review, :message => "BEWARE: you are not authorized to create new review."

		respond_to do |format|
			if @review.save

UPDATE "reviews" SET "rating" = ?, "description" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["rating", 5], ["description", ":o_"], ["updated_at", "2022-06-10 15:00:10.295273"], ["id", 108]]
---
	def update
		# Autorizzazioni (Canard + CanCan)
		authorize! :update, @review, :message => "BEWARE: you are not authorized to update reviews."

		respond_to do |format|
			if @review.update(review_params)

DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 101]]
---
	def destroy

		# Autorizzazioni (Canard + CanCan)
		if (current_user != @review.user)
			authorize! :destroy, @review, :message => "BEWARE: you are not authorized to delete reviews."
		end

		@review.destroy