app/controllers/video_uploads_controller.rb

	def create
		@video_upload = VideoUpload.new(title: params[:video_upload][:title], description: params[:video_upload][:description], file: params[:video_upload][:file].try(:tempfile).try(:to_path))

		if @video_upload.save
			uploaded_video = @video_upload.upload!(current_user)

			if uploaded_video.failed?
				flash[:error] = 'There was an error while uploading your video...'
			else

				recipe = Recipe.find_by(title: params[:video_upload][:recipetitle].to_s.split(/\s+/).map(&:downcase).map(&:capitalize).join(' '))
				recipe.video = "https://www.youtube.com/watch?v=#{uploaded_video.id}"
				recipe.save!
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."title" = ? LIMIT ?  [["title", "Prova Ricetta"], ["LIMIT", 1]]
UPDATE "recipes" SET "description" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["description", "https://www.youtube.com/watch?v=\#{uploaded_video.id}"], ["updated_at", "2022-06-08 17:39:21.207968"], ["id", 49]]