app/models/user.rb

INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "provider", "uid", "token") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ? ORDER BY "users"."id" ASC LIMIT ?  [["provider", "google_oauth2"], ["uid", "107432839470448356463"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "provider", "uid", "token", "roles_mask") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def self.from_omniauth(auth)

		where(provider: auth.provider, uid: auth.uid).first_or_create do |user|
			user.email = auth.info.email
			user.password = Devise.friendly_token[0,20]
			# user.full_name = auth.info.name		# Il model dell'user deve avere un "name"
			# user.avatar_url = auth.info.image		# Il model dell'user deve avere un "image"
			# user.skip_confirmation!	# Serve a skippare l'invio della conferma da parte di Google (utile se stiamo già inviando una mail con :confirmable)

			user.token = auth.credentials.token
			user.save!