app/controllers/users/omniauth_callbacks_controller.rb

	def google_oauth2
		# You need to implement the method below in your model (e.g. app/models/user.rb)

		@user = User.from_omniauth(request.env["omniauth.auth"])
		# Serve per il token per effettuare richieste all'API, non so se è giusto e se funziona...
		if @user.persisted?		# Se l'utente esiste già nel database locale
			sign_in_and_redirect @user, :event => :authentication	# This will throw if @user is not activated
			set_flash_message(:notice, :success, :kind => "Google") if is_navigational_format?

		else					# Se l'utente non esiste nel database locale (viene registrato con Google)
			session["devise.google_data"] = request.env["omniauth.auth"]
			redirect_to new_user_registration_url
		end

		@user.token = request.env["omniauth.auth"].credentials.token
		@user.save!
---
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "provider", "uid", "token", "roles_mask") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "updated_at" = ?, "token" = ? WHERE "users"."id" = ?